/*
Курс: Стивен Прата "Язык программирования C"
Глава: 2
Дата выполнения: 21.02.2023
Код выполнила студентка группы 22ИС: Левченко А.И.
Код проверил преподаватель МДК.01.01: Гусятинер Л.Б.
*/

/*
2.
Напишите программу, печатающую ваше имя и адрес. 
*/

#include <stdio.h>
#include <string.h>
int main()
{
    printf("Саша Левченко\n");
    printf("Город Пушкино, ул.Центральная, д.9, кв.9");
    return 0;
}